import React from 'react'

const EighteenthPage: React.FC<any> = ({ tasks }: { tasks: any }) => {
    return (
        <div className="w-full">
            <div className="space-y-4 ">
                <div>
                    <h3 className="font-semibold mb-2">49. فتح العروض</h3>
                    <p className="mb-3">مع مراعاة الأحكام الواردة في المادة (الرابعة والأربعين) من النظام، تلتزم لجنة فتح العروض بالآتي:</p>
                    <p className="mb-3"><span className="font-semibold">أولاً:</span> تفتح العروض فور انتهاء المدة المحددة لتلقيها ، وفي العروض التي تتضمن ملفين إلكترونيين، تفتح اللجنة الملف الفني فقط بحضور من يرغب من أصحاب العروض.</p>
                    <p className="mb-3"><span className="font-semibold">ثانياً:</span> في حال تقديم العرض في ملفين إلكترونيين، تحال العروض الفنية بعد فتحها، والعروض المالية قبل فتحها، ومحضر اللجنة إلى لجنة فحص العروض.</p>
                    <p className="mb-3"><span className="font-semibold">ثالثاً:</span> إذا لم تتمكن لجنة فتح العروض من القيام بعملها لأسباب مبررة، يؤجل موعد فتح العروض المدة اللازمة والضرورية-بعد موافقة رئيس الجهة الحكومية أو من يفوضه ، ويحدد له موعد آخر يُبلغ به المتقدمون للمنافسة. ولا يجوز في هذه الحالة قبول عروض جديدة أثناء فترة التأجيل.</p>
                    <p className="mb-3"><span className="font-semibold">رابعاً:</span> في حال تقديم العرض في ملف إلكتروني واحد فتعلن لجنة فتح العروض اسم مقدم العرض وسعره الإجمالي وما ورد عليه من زيادة أو تخفيض في خطاب العرض الأصلي وكذلك ما إذا قدم جميع الوثائق المطلوبة والضمان الابتدائي وقيمته، وفي حال تقديم العرض في ملفين الكترونيين فتعلن لجنة فتح العروض اسم مقدم العرض فقط. </p>
                    <p className="mb-3"><span className="font-semibold">خامساً:</span> لا يجوز للجنة فتح العروض أن تستبعد أي عرض أو أن تطلب من أصحاب العروض تصحيح الأخطاء أو تلافي الملاحظات الواردة في عروضهم، وعليها الامتناع عن استلام أي عروض أو مظاريف أو خطابات أو عينات يقدمها لها أصحاب العروض أثناء جلسة فتح العروض.</p>

                </div>
            </div>
        </div>

    )
}

export default EighteenthPage