import React from 'react'

const FifthPage: React.FC<any> = ({ tasks }: { tasks: any }) => {
    return (
        <div className="w-full text-blue-700">
            <div className="py-6 max-w-[1200px] mx-auto space-y-4 ">
                <h1 className="text-2xl font-semibold mb-8 text-center">دليل الاستخدام</h1>
                <p>النصوص الواردة في هذا النموذج تصنف وتفهم كما يلي :</p>
                <ul className="list-decimal pr-5 space-y-2">
                    <li>
                        <span className="text-black">اللون الأسود:</span> يشير إلى النصوص الثابتة التي لا يجوز إحداث التغييرات عليها إلا فيما يوجبه النظام أو يجيزه.
                    </li>
                    <li>
                        <span className="text-green-600">اللون الأخضر:</span> يشير إلى نصوص يمكن استخدامها ويجوز للجهة الحكومية أن تستبدلها في حدود ما نص عليه النظام ولوائحه أو أغراض بنودها وفي حدود متطلبات نطاق العمل وطبيعة العملية أو المشروع.
                    </li>
                    <li>
                        <span className="text-red-600">اللون الأحمر:</span> أمثلة ليستأنس بها ويجوز للجهة الحكومية إزالتها أو استبدالها بما يلائم.
                    </li>
                    <li className="text-blue-600">
                        اللون الأزرق: إرشادات وملاحظات للجهة الحكومية [يجب إزالتها من النسخة المنشورة في وثائق المنافسة].
                    </li>
                    <li>
                        الأقواس المربعة [ ] أو ما بينها: ينبغي على المحرر التنبه إليها وأن يراعي ما يلزمها من تعديل أو تحرير أو إضافة محتوى قبل اعتماد الكراسة.
                    </li>
                </ul>

                <div className="mt-8">
                    <p>
                        <strong className="font-arMedium">ملاحظة وتنويه:</strong><br />
                        تلتزم الجهة الحكومية بالامتثال لأحكام نظام المنافسات والمشتريات الحكومية ولوائحه حين إعداد هذه الكراسة وعليها أن تتجنب إضافة أحكام أو شروط أو معايير تخالفها، ويجب على الجهة الحكومية أن تتأكد من إرفاق ما يلزم من مستندات ووثائق بما في ذلك ما أوجبته اللائحة التنفيذية في مادتها الحادية والعشرون بإرفاق نص العقد المزمع إبرامه، وشروطه وأحكامه، ومن ذلك طرق الدفع وآلية احتساب الغرامات.
                    </p>
                </div>
            </div>
        </div>

    )
}

export default FifthPage
