import React from 'react'

const FourteenthPage: React.FC<any> = ({ tasks }: { tasks: any }) => {
  return (
    <div className="w-full text-black">
      <div className="py-6 max-w-[1200px] mx-auto space-y-4 ">
        <div className="border-b border-gray-300 pb-4 mb-6">
          <h3 className="font-semibold text-lg">القسم الثالث: إعداد العروض</h3>
        </div>

        <div className="border-b border-gray-300 pb-4 mb-6">
          <h3 className="font-semibold mb-2">27. لغة العرض</h3>
          <p>يجب أن تقدم العروض باللغة العربية مع إمكانية تقديم بعض الوثائق أو جزء من العرض بلغة أخرى إلى جانب اللغة العربية. وفي حال وجد تعارض بين النص العربي والنص الأجنبي للعروض فإنه يؤخذ بالنص الوارد باللغة العربية.</p>
        </div>

        <div className="border-b border-gray-300 pb-4 mb-6">
          <h3 className="font-semibold mb-2">28. العملة المعتمدة</h3>
          <p>تعتبر العملة {tasks?.authrisedCurrency || "السعودية (الريال السعودي)"} العملة المعتمدة بكافة التعاملات المتعلقة بالمنافسة ويتم الصرف طبقاً للأنظمة واللوائح المالية المتبعة في نظام المنافسات والمشتريات الحكومية.</p>
        </div>

        <div className="border-b border-gray-300 pb-4 mb-6">
          <h3 className="font-semibold mb-2">29. صلاحية العروض</h3>
          <p>يجب أن تكون مدة سريان العروض في هذه المنافسة (90) تسعين يومًا من التاريخ المحدد لفتح العروض.</p>
        </div>

        <div className="border-b border-gray-300 pb-4 mb-6">
          <h3 className="font-semibold mb-2">30. تكلفة إعداد العروض</h3>
          <p>يتحمل المتنافسون جميع التكاليف المرتبطة بالمنافسة، ولا تتحمل الجهة الحكومية أي مسؤولية لتغطية تكاليف المتنافسين في إعداد العروض، والتي تتضمن تلك التكاليف التي يتكبدها المتنافسون للقيام بالعناية الواجبة، والتكاليف المتعلقة بتقديم أي معلومات إضافية للجهة، بالإضافة إلى التكاليف المرتبطة بأي مفاوضات مع الجهة الحكومية. كما يجب على المتنافسين تزويد الجهة الحكومية بأي توضيحات مطلوبة طوال مدة المنافسة، دون إلزام الجهة الحكومية بتغطية التكاليف المرتبطة بذلك.</p>
        </div>

        <div className="border-b border-gray-300 pb-4 mb-6">
          <h3 className="font-semibold mb-2">31. الإخطارات والمراسلات</h3>
          <p>تعد البوابة الإلكترونية أو الوسيلة البديلة هي الوسيلة المعتمدة لكافة الإخطارات والمراسلات المتعلقة بالمنافسة، وفي حال تعذر ذلك فيتم التواصل مع ممثل الجهة الحكومية المذكور في الفقرة 7 من هذه الكراسة.</p>
        </div>

        <div className="border-b border-gray-300 pb-4 mb-6">
          <h3 className="font-semibold mb-2">32. ضمان المعلومات</h3>
          <p>يلتزم مقدم العرض باتخاذ جميع الإجراءات اللازمة للتحقق من دقة المعلومات المتعلقة بالمنافسة ليتسنى له تقديم عرض متوافق مع جميع الشروط والمواصفات المطلوبة مع الأخذ بالاعتبار جميع الأحكام التعاقدية، كما يجب على جميع المتنافسين الإلمام بجميع الأنظمة والقرارات ذات العلاقة بنطاق عمل المنافسة ومراعاة ذلك عند تحديد الأسعار.</p>
        </div>

        <div className="border-b border-gray-300 pb-4 mb-6">
          <h3 className="font-semibold mb-2">33. الأسئلة والاستفسارات</h3>
          <p>يمكن للمتنافسين في حال وجود أي استفسارات عن المنافسة، أن يرسلوا استفساراتهم عن طريق البوابة الإلكترونية أو الوسيلة البديلة خلال <span>{tasks.timelineToSendInquiries || "(10) عشرة أيام"}</span>  من تاريخ طرح المنافسة. وتلتزم الجهة الحكومية بالرد على استفسارات المتنافسين عن طريق البوابة الإلكترونية أو الوسيلة البديلة خلال مدة لا تتجاوز <span>{tasks.timelineToAnswerInquiries || "(7) سبعة أيام"} </span> من ذلك التاريخ، وفي حال تعذر ذلك فعلى الجهة الحكومية الرد عن طريق <span>{tasks.officialEmail || "البريد الرسمي"}</span> وعلى الجهة الحكومية جمع كافة الاستفسارات المقدمة من المتنافسين والإجابة عليها ومشاركتها مع جميع المتنافسين دون الكشف عن هوية المتنافس مقدم الاستفسار عن طريق البوابة الإلكترونية أو الوسيلة البديلة. كما يمكن للجهة الحكومية تنظيم ورشة عمل لمناقشة كافة الاستفسارات المقدمة والإجابة عليها.</p>
        </div>

        <div className="border-b border-gray-300 pb-4 mb-6">
          <h3 className="font-semibold mb-2">34. حصول المتنافسين على كافة المعلومات الضرورية وزيارة موقع الأعمال</h3>
          <p>على صاحب العرض المتقدم لتنفيذ الأعمال والمشتريات أن يتحرى قبل تقديم عرضه عن طبيعة الأعمال المتقدم لها، والظروف المصاحبة للتنفيذ، ومعرفة بياناتها وتفصيلاتها على وجه الدقة، وما يمكن أن يؤثر في فئات عرضه ومخاطر التزاماته، وعليه بشكل عام أن يسعى للحصول على كافة المعلومات الضرورية واللازمة لتنفيذ عطائه، وأن يقوم بفحص موقع الأعمال ومعاينته وكذلك الأماكن المحيطة به، وعلى الجهة الحكومية إتاحة الفرصة للمتنافسين إجراء زيارات ميدانية للموقع -متى كان ذلك ممكناً- بحسب طبيعة المشروع.</p>
        </div>
      </div>
    </div>

  )
}

export default FourteenthPage
