import React from 'react'

const NinthPage: React.FC<any> = ({ tasks }: { tasks: any }) => {
  return (
    <div className="w-full text-black">
      <div className="py-6 space-y-4 ">

        <h2 className="text-xl font-bold text-gray-900 border-b border-gray-300 pb-4">القسم الثاني: الأحكام العامة</h2>

        <div className="border-b border-gray-300 pb-4">
          <h3 className="font-semibold text-lg text-gray-900">10. المساواة والشفافية</h3>
          <p>
            على الجهة الحكومية اطلاع كافة المتنافسين على المعلومات ذات العلاقة بنطاق العمل في المنافسة بما يمكنهم من تقييم الأعمال قبل الحصول على وثائق المنافسة، وتقديم الإيضاحات والبيانات اللازمة عن الأعمال والمشتريات المطلوب تنفيذها قبل ميعاد تقديم العروض بوقتٍ كافٍ وتلتزم الجهة بعدم التمييز بين المتنافسين في أي مما سبق.
            كما سيتم إخطار كافة المتقدمين للمنافسة بأي تغيرات تطرأ على المنافسة عبر البوابة الإلكترونية أو الوسيلة البديلة، وإن تعذر ذلك فعن طريق البريد الرسمي أو البريد الإلكتروني على النحو المبين بأحكام النظام واللائحة التنفيذية.
          </p>
        </div>

        <div className="border-b border-gray-300 pb-4">
          <h3 className="font-semibold text-lg text-gray-900">11. تعارض المصالح</h3>
          <p>
            يلتزم المتنافس والعاملون لديه والشركات التابعة له ومتعاقدوه من الباطن، وكل من له علاقة مباشرة أو غير مباشرة بتنفيذ وتأمين الأعمال والمشتريات المضمنة في نطاق هذه المنافسة، بإبلاغ الجهة الحكومية والإفصاح كتابة عن أي حالة تعارض في المصالح أو أي مصلحة خاصة نشأت أو ستنشأ أو قد تنشأ عن أي تعامل يكون مرتبطاً بأنشطة الجهة الحكومية، وذلك وفقاً للائحة تنظيم تعارض المصالح.
          </p>
        </div>

        <div className="border-b border-gray-300 pb-4">
          <h3 className="font-semibold text-lg text-gray-900">12. السلوكيات والأخلاقيات</h3>
          <p>
            يحظر على المتنافس والعاملين لديه والشركات التابعة له ومتعاقديه من الباطن، وكل من له علاقة مباشرة أو غير مباشرة بتنفيذ وتأمين الأعمال والخدمات التي تتضمنها هذه المنافسة، مخالفة قواعد السلوك المهني وقواعد أخلاقيات المهنة وغيرها من القواعد التي نصت عليها الأنظمة المعمول بها أو المفروضة عليهم بموجب عضويتهم في أي منظمة مهنية أو هيئة ذات علاقة.
          </p>
          <p>
            وفي كل الأحوال يلتزم بعدم الحصول أو محاولة الحصول على ميزة غير مستحقة بأي طريقة كانت أو تقديم أي هدية أو أي منفعة سواءً مادية أو معنوية للحصول على معاملة تفضيلية من موظفي الجهة الحكومية في كافة مراحل تنفيذ المنافسة أو أي عقد ينتج عنها.
          </p>
        </div>

        <div className="border-b border-gray-300 pb-4">
          <h3 className="font-semibold text-lg text-gray-900">13. السرية وإفشاء المعلومات</h3>
          <p>
            يلتزم المتنافسون بعدم إفشاء أي بيانات أو رسومات أو وثائق أو معلومات تتعلق بالمنافسة سواءً كانت تحريرية أو شفهية أو استغلالها أو الإفصاح عنها. ويسري ذلك على كل ما بحوزته أو ما يكون قد اطلع عليه في العرض من أسرار وتعاملات أو شؤون تخص الجهة الحكومية.
          </p>
          <p>
            كما لا يجوز للمتنافسين نشر أي معلومة عن المنافسة وكل ما يتعلق بها عبر كافة وسائل الإعلام إلا بعد أخذ موافقة كتابية من الجهة الحكومية مسبقاً.
          </p>
        </div>

        <div className="border-b border-gray-300 pb-4">
          <h3 className="font-semibold text-lg text-gray-900">14. ملكية وثائق المنافسة</h3>
          <p><span className="font-semibold">أولاً:</span> ستبقى ملكية وثائق المنافسة وجميع نسخها للجهة الحكومية ويجب على المتنافسين إتلاف تلك الوثائق وجميع نسخها عند طلب الجهة الحكومية ذلك.</p>
          <p>
            <span className="font-semibold">ثانياً:</span> حقوق الطبع والنشر وسائر الحقوق في أي وثيقة أو مصنف أو تصميم أو مادة أو عنصر يرافق أو تشتمل عليه المنافسة ووثائقها أو ما تقدمه من الجهة الحكومية ضمن هذه المنافسة ستبقى ملكًا للجهة الحكومية ولن تؤول إلى المتنافس، وعلى ذلك لا يجوز نسخ هذه الوثائق والمواد، كليًا أو جزئيًا، أو إعادة إنتاجها أو توزيعها أو إتاحتها لأي طرف ثالث أو استخدامها دون الحصول على موافقة كتابية مسبقة من الجهة الحكومية.
          </p>
          <p>ويجب على المتنافس التخلص منها أو إعادتها إلى الجهة الحكومية عند الطلب، وألا يحتفظ المتنافس بأي نسخ من قبله أو من قبل من مكنهم من الوصول إليها.</p>
        </div>

        <div>
          <h3 className="font-semibold text-lg text-gray-900">15. حقوق الملكية الفكرية</h3>
          <p>
            تكون الملكية الفكرية لمحتويات العرض الفائز (أو العروض الفائزة) للجهة الحكومية، ويحق لها استعمالها والتصرف فيها وفق ما تراه مناسباً لتحقيق المصلحة العامة.
          </p>
        </div>
      </div>
    </div>
  )
}

export default NinthPage
