import React from 'react'

const NinteenthPage: React.FC<any> = ({ tasks }: { tasks: any }) => {
    return (
        <div className="w-full text-black">
            <div className="py-6 mx-auto space-y-4 ">
                <div className="border-b border-gray-300 pb-4 mb-6">
                    <h3 className="font-semibold">القسم الخامس: تقييم العروض</h3>
                </div>

                <div className="border-b border-gray-300 pb-4 mb-6">
                    <h3 className="font-semibold mb-2">50. سرية تقييم العروض</h3>
                    <p>
                        تلتزم الجهة الحكومية بعدم إفشاء أي بيانات أو رسومات أو وثائق أو معلومات تتعلق بتقييم العروض المستلمة، سواءً كان الإفشاء تحريرياً أو شفهياً، أو استغلالها أو الإفصاح عنها إلى أي شخص، ويسري ذلك على كل ما بحوزتها أو ما تكون قد اطلعت عليه في العروض من أسرار وتعاملات أو شؤون تخص المتنافسين، باستثناء نشر المعلومات التي يطلب من الجهة الحكومية نشرها بموجب الأنظمة السارية.
                    </p>
                </div>

                <div className="border-b border-gray-300 pb-4 mb-6">
                    <h3 className="font-semibold mb-3">51. معايير تقييم العروض</h3>
                    <p className="mb-3">
                        يراعى في معايير تقييم العروض أن تكون واضحة وموضوعية ومحققة للمصلحة العامة وألا تهدف إلى ترسيه الخدمات على متنافسين محددين، على أن يؤخذ في الاعتبار عند إعدادها بما يلي:
                    </p>
                    <ol className="pr-6 space-y-1 mt-2 text-black" dir="rtl" lang="ar-sa">
                        {tasks?.criteriaForEvaluatingOffers?.map((item: any, index: number) => {
                            const arabicNumber = (index + 1).toLocaleString('ar-EG'); // or 'ar-SA'
                            return (
                                <li key={index}>
                                    <span className="ml-2">{arabicNumber}.</span> {item}
                                </li>
                            );
                        })}
                    </ol>
                </div>

                <div className="border-b border-gray-300 pb-4 mb-6">
                    <h3 className="font-semibold mb-2">52. تصحيح العروض</h3>
                    <p><span className="font-semibold">أولاً:</span> على لجنة فحص العروض مراجعة جداول الكميات والأسعار الواردة في العرض - سواء في مفرداتها أو مجموعها - وإجراء التصحيحات الحسابية اللازمة في العرض.</p>
                    <p className="mb-3"><span className="font-semibold">ثانياً:</span> إذا وجد اختلاف بين السعر المبين كتابة والسعر المبين بالأرقام، يؤخذ بالسعر المبين كتابة، وإذا وجد اختلاف بين سعر الوحدة وسعر مجموعها، فيؤخذ بسعر الوحدة، إلا في حال وجود أخطاء مادية بالسعر المبين بالأرقام أو سعر مجموع الوحدات -مثل وضع علامة عشرية في غير موضعها- فللجنة فحص العروض الأخذ بتلك الأسعار.
                    </p>

                    <p className="mb-3"><span className="font-semibold">ثالثاً:</span>  إذا وجدت دلائل تؤكد عدم صحة السعر وفقاً لأسلوب التصحيح الوارد في ثانياً من هذه الفقرة، فيحق للجنة فحص العروض -بعد التأكد من التوازن المالي لأسعار البنود ومقارنة السعر مع أمثاله في العرض والعروض الأخرى وسعر السوق والأسعار التقديرية- الأخذ بالسعر الوارد في العرض الذي يثبت لها صحته، ويستبعد المتنافس عند رفضه لهذا السعر.
                    </p>

                    <p className="mb-3"><span className="font-semibold">رابعاً:</span>  يجوز للجنة فحص العروض التوصية باستبعاد العرض إذا تجاوزت الأخطاء الحسابية في الأسعار بعد تصحيحها وفقاً لأحكام هذه الفقرة أكثر من (10%) من قائمة الأسعار أو إجمالي قيمة العرض زيادةً أو نقصاً.
                    </p>

                </div>

                <div>
                    <h3 className="font-semibold mb-3">53. فحص العروض</h3>
                    <p className="mb-3">
                        تلتزم لجنة فحص العروض، عند تقييم العروض بمعايير التأهيل ومعايير التقييم وشروط المنافسة، مع الأخذ بعين الاعتبار ما يلي:
                    </p>

                    <p className="mb-3"><span className="font-semibold">أولاً:</span> إذا لم تتوافر لدى صاحب العرض أياً من الشهادات المطلوبة والمنوه عنها تفصيلاً في الفقرة (6) من هذه الكراسة أو كانت الشهادات المقدمة منتهية الصلاحية، فيمنح صاحب العرض مدة تحددها لجنة فحص العروض على ألا تزيد على (عشرة) أيام عمل لاستكمال تلك الشهادات فإن لم يقدمها في الوقت المحدد يستبعد من المنافسة ويصادر الضمان الابتدائي.</p>
                    <p className="mb-3"><span className="font-semibold">ثانياً:</span> إذا أغفل المتنافس وضع أسعار لبعض البنود جاز للجنة فحص العروض استبعاد عرضه أو اعتبار البنود غير المسعرة محملة على القيمة الإجمالية للعرض. ويعتبر المتنافس موافقاً على هذا الشرط عند تقديمه للعرض.
                    </p>
                    <p className="mb-3"><span className="font-semibold">ثالثاً:</span> في حال عدم تنفيذ المتنافس للبنود المحملة على إجمالي قيمة العرض يتم تنفيذها على حسابه، أو يحسم ما يقابل تكلفتها؛ وذلك بحسب متوسط سعر البند لدى المتقدمين للمنافسة، أو السعر الذي تقدره لجنة فحص العروض في حال العرض الواحد أو عدم تسعير البنود المغفلة من المتنافسين.
                    </p>
                    <p className="mb-3"><span className="font-semibold">رابعاً:</span> إذا عدلت الجهة الحكومية عن تنفيذ أي بند من البنود المحملة على إجمالي قيمة العرض يُحسم ما يقابل تكلفتها بحسب متوسط سعر البند لدى المتقدمين للمنافسة، أو السعر الذي تقدره لجنة فحص العروض في حال العرض الواحد أو عدم تسعير البنود المغفلة من المتنافسين.
                    </p>
                    <p className="mb-3"><span className="font-semibold">خامساً:</span> إذا تساوى عرضان أو أكثر في التقييم الكلي، فتتم الترسية على أقل العروض سعراً فإذا تساوت في ذلك، فتقوم الجهة الحكومية بتجزئة المنافسة بين العروض المتساوية، متى كانت شروط ومواصفات المنافسة تسمح بذلك، وإذا لم ينص على التجزئة، فتكون الأولوية في الترسية للمنشآت الصغيرة والمتوسطة المحلية، وتجرى منافسة مغلقة بين العروض المتساوية في حال تعذر ذلك.
                    </p>
                    <p className="mb-3"><span className="font-semibold">سادساً:</span> للجنة فحص العروض إعادة تسعير البنود، إذا تبين لها أنها وضعت بشكل غير مدروس ولا تمثل السعر الحقيقي للبنود، على ألّا يؤثر ذلك في السعر الإجمالي للعرض. فإذا رفض المتنافس إعادة التسعير، يستبعد من المنافسة ويرد له ضمانه.
                    </p>
                </div>
            </div>
        </div>
    )
}

export default NinteenthPage