import React from 'react'

const SeventeenthPage: React.FC<any> = ({ tasks }: { tasks: any }) => {
    return (
        <div className="w-full text-black">
            <div className="py-6 max-w-[1200px] mx-auto space-y-4 ">
                <div className="border-b border-gray-300 pb-4 mb-6">
                    <h3 className="font-semibold">القسم الرابع: تقديم العروض</h3>
                </div>

                <div className="border-b border-gray-300 pb-4 mb-6">
                    <h3 className="font-semibold mb-2">45. آلية تقديم العروض</h3>
                    <p className="mb-2"><span className="font-semibold ">أولاً:</span> يقوم المتنافس بتقديم عرضه في الموعد المحدد من خلال البوابة الإلكترونية أو الوسيلة البديلة. وفي حال تعطل البوابة الإلكترونية أو الوسيلة البديلة لمدة تزيد على ثلاثة أيام فيجوز تقديم العروض بشكل ورقي لممثل الجهة الحكومية في الوقت والمكان المحددين ويتم تقديم العروض على النحو الآتي:</p>

                    <ul className="pr-5 space-y-2 mb-3">
                        <li className={tasks?.twoFiles ? "" : "hidden"}><span>أ.</span> {tasks?.twoFiles}</li>
                        <li><span>{tasks?.twoFiles ? "ب." : "أ."}</span> ‌يقدم العرض – وكافة مرفقاته - بموجب خطاب رسمي يوقع من مقدمه أو ممن يملك حق التمثيل النظامي.</li>
                        <li><span>{tasks?.twoFiles ? "ج." : "ب."}</span> ‌تقدم مع العرض الوثائق المذكورة في الفقرتين 35 و36 من هذه الكراسة.</li>
                        <li><span>{tasks?.twoFiles ? "د." : "ج."}</span> ‌في حال تعذر تقديم العروض من خلال البوابة الإلكترونية لأسباب فنية، يتم تقديمها في مظاريف مختومة بواسطة البريد الرسمي، أو تسليمها للجهة الحكومية في المكان المحدد لاستقبال العروض، مع أخذ إيصال يبين فيه تاريخ وساعة التسليم، وعلى الجهة الحكومية رفع العروض التي تقدم ورقياً على البوابة لحفظها في سجلاتها، وذلك بعد فتحها من قبل لجنة فتح العروض.</li>
                        <li><span>{tasks?.twoFiles ? "ه." : "د."}</span> ‌تعلن أسماء المتنافسين الذين تقدموا بعروضهم في البوابة، وذلك بعد انتهاء موعد تقديم العروض وفتحها، فإذا تعذر إعلانها في البوابة، تعلن في الموقع الإلكتروني للجهة الحكومية.</li>
                    </ul>

                    <p className="mb-2 ">
                        <span className="font-semibold">ثانياً:</span> {tasks?.externalMechanism}
                    </p>
                </div>

                <div className="border-b border-gray-300 pb-4 mb-6">
                    <h3 className="font-semibold text-gray-800">46. تسليم العروض المتأخرة</h3>
                    <p>لا يعتد بأي عرض يصل إلى الجهة الحكومية بعد انتهاء المدة المحددة لتقديم العروض أو يقدم بوسيلة مخالفة، كما يتحمل المتنافس مسؤولية تعذر وصول العرض أو العطب الذي يلحق بالمجلدات والملفات التي تحوي عرضه وتبعات تقدير كفاية الوقت اللازم لتقديم عرضه ووصوله.</p>
                </div>

                <div className="border-b border-gray-300 pb-4 mb-6">
                    <h3 className="font-semibold mb-3">47. تمديد فترة تلقي العروض وتأجيل فتحها</h3>
                    <p className="mb-3"><span className="font-semibold">أولاً:</span> إذا لم تتمكن الجهة الحكومية من البت في الترسية خلال مدة سريان العروض، تعد لجنة فحص العروض محضرًا توضح فيه أسباب ومبررات التأخير في البت بالترسية، وتُشعر الجهة الحكومية أصحاب العروض برغبتها في تمديد سريان عروضهم لمدة لا تزيد عن (تسعين) يوم أخرى.</p>

                    <p className="mb-3"><span className="font-semibold">ثانياً:</span>  على من يوافق من أصحاب العروض على التمديد، أن يمدد ضماناته وأن يبلغ الجهة الحكومية بذلك خلال (أسبوعين) من تاريخ الإشعار بطلب التمديد. ومن لم يتقدم خلال هذه المدة، عُد غير موافق على تمديد عرضه، ويعاد له ضمانه الابتدائي في هذه الحالة.</p>

                    <p className="mb-3"><span className="font-semibold">ثالثاً:</span> إذا مضت المدد المشار إليها في هذه المادة، لا يجوز للجهة الحكومية تمديد سريان العروض إلّا بعد موافقة وزارة المالية بناءً على أسباب مبررة، وإلّا تلغى المنافسة.</p>
                </div>

                <div>
                    <h3 className="font-semibold mb-2">48. الانسحاب</h3>
                    <p>يجوز للمتنافس أن يسحب عرضه قبل الموعد النهائي المحدد لتسليم العروض، وعلى الجهة الحكومية أن ترد له ضمانه الابتدائي. أما إذا قرر الانسحاب بعد الموعد المحدد لتسليم العروض، فيصادر الضمان الابتدائي. وإذا كان المتنافس من المنشآت الصغيرة والمتوسطة، يتوجب عليه عند الانسحاب دفع غرامة مالية للجهة الحكومية تساوي قيمة الضمان الابتدائي. وفي حال مرور (60)...</p>
                </div>

            </div>
        </div>
    )
}

export default SeventeenthPage