import React from 'react'

const SixteenthPage: React.FC<any> = ({ tasks }: { tasks: any }) => {
    return (
        <div className="w-full text-black">
            <div className="py-6 max-w-[1200px] mx-auto space-y-4 ">
                <div className="border-b border-gray-300 pb-4">
                    <h3 className="font-semibold mb-2">41. الضمان الابتدائي</h3>
                    <p className="mb-2"><span className="font-semibold">أولاً:</span> على المتنافس تقديم الضمان الابتدائي بنسبة {" " + tasks.inatialGuaranteePercentage + "% " || ""} من القيمة الإجمالية للعرض مع مراعاة الأحكام العامة للضمانات أعلاه ووفقاً للشروط التالية:</p>
                    <ul className="pr-5 space-y-2">
                        <li><span>أ.</span> لا يجوز قبول العرض الذي يقدم بدون ضمان ابتدائي وللجهة الحكومية قبول الضمان الناقص متى كانت نسبة النقص لا تتجاوز (10%) من قيمة الضمان المطلوب، وفي هذه الحالة، على لجنة فحص العروض -قبل التوصية بالترسية على مقدم الضمان الناقص- أن تطلب منه استكمال النقص في الضمان خلال مدة تحددها اللجنة لا تزيد عن (عشرة) أيام عمل، وإلّا عُد منسحباً ولا يعاد إليه الضمان الابتدائي.</li>
                        <li><span>ب.</span> يُقدم أصل خطاب الضمان الابتدائي مع العرض، على أن يكون الضمان الابتدائي ساري المفعول مدة لا تقل عن (90) تسعين يوماً من التاريخ المحدد لفتح العروض، وفي حال كان الضمان ناقص المدة بما لا يتجاوز (ثلاثين) يوماً، تعين على لجنة فحص العروض -قبل التوصية بالترسية على مقدم الضمان الناقص- أن تطلب منه استكمال النقص في الضمان خلال مدة تحددها اللجنة، وإلا يعد منسحباً ولا يعاد إليه الضمان الابتدائي، ولا يعد اليوم واليومين نقصاً في مدة الضمان.</li>
                        <li><span>ت.</span> تقوم الجهة الحكومية بطلب تمديد الضمان الابتدائي لمن رست عليه العقد متى كان تاريخ انتهاء سريانه قبل تقديم الضمان النهائي.</li>
                        <li><span>ث.</span> ترد الضمانات الابتدائية إلى أصحاب العروض التي لم يتم الترسية عليها بعد البت في الترسية، وكذلك في حال إلغاء المنافسة، أو بعد انتهاء الوقت المحدد لسريان العروض ما لم يبد صاحب العرض رغبته في الاستمرار في الارتباط بعرضه وفقاً لأحكام النظام واللائحة التنفيذية.</li>
                        <li><span>ج.</span> وبخلاف ما ورد أعلاه وفيما لم يرد فيه نص يقتضي مصادرة الضمان الابتدائي، ترد الضمانات الابتدائية لأصحابها ويجوز للجهة الحكومية بناءً على تقديرها أو بطلب من أصحاب العروض الإفراج عن ضماناتهم الابتدائية قبل البت في الترسية، إذا تبين بعد فتح المظاريف وانكشاف الأسعار أن أسعار تلك العروض مرتفعة، أو مخالفة للشروط والمواصفات، بما يحول دون الترسية على أي منها.</li>
                        <li><span>ح.</span> في حال تقديم العرض في ملفين إلكترونيين، يقدم الضمان الابتدائي في ملف العرض المالي.</li>
                    </ul>

                    <p className="mb-2 pt-6"><span className="font-semibold">ثانياً:</span> ويُستثنى من تقديم الضمان الابتدائي وفقاً للحالات التالية:</p>
                    <ul className="list-disc pr-5 space-y-2">
                        <li><span>أ.</span> الشراء المباشر.</li>
                        <li><span>ب.</span> المسابقة.</li>
                        <li><span>ت.</span> تعاقدات الجهات الحكومية فيما بينها، بشرط أن تنفذ الخدمات وتؤمن المشتريات بنفسها.</li>
                        <li><span>ث.</span> التعاقد مع مؤسسة أو جمعية أهلية أو كيان غير هادف إلى الربح، بشرط أن تتولى بنفسها القيام بما تم التعاقد عليه.</li>
                        <li><span>ج.</span> التعاقد مع المنشآت الصغيرة والمتوسطة المحلية.</li>

                    </ul>
                    <p className="mb-2 pt-6 text-green-700">الأعمال والمشتريات التي تنفذ خارج المملكة العربية السعودية</p>
                </div>
                <div className="border-b border-gray-300 pb-4">
                    <h3 className="font-semibold mb-2">42. مصادرة الضمانات</h3>
                    <p className="mb-2"><span className="font-semibold">أولًا:</span> على الجهة الحكومية عند توافر أسباب مصادرة الضمان الابتدائي، العرض على لجنة فحص العروض أو لجنة فحص عروض الشراء المباشر بحسب الحال؛ لدراسة الحالة وتقديم توصية مسببة إلى صاحب الصلاحية في الترسية، مع الأخذ في الاعتبار الآثار</p>
                    <p className="mb-2 pt-6">المترتبة على المصادرة ومدة سريان الضمان. ويجوز للجهة طلب تمديد الضمان مدة معقولة إذا كانت إجراءات اتخاذ قرار المصادرة تتطلب ذلك. </p>
                    <p className="mb-2"><span className="font-semibold">ثانيًا:</span> لا يجوز مصادرة الضمان إلّا للأسباب التي تم تقديم الضمان لأجلها، ويكون طلب المصادرة مقتصراً على الضمان الخاص بالعملية التي أخل المتعاقد فيها بالتزاماته، ولا يمتد إلى مصادرة الضمانات الخاصة بالعمليات الأخرى سواء كانت لدى جهة واحدة أو عدة جهات.</p>
                    <p className="mb-2"><span className="font-semibold">ثالثًا:</span> عند مصادرة الضمان الابتدائي في المنافسات المجزأة، تقتصر المصادرة على جزء من قيمة الضمان منسوبة إلى قيمة الأعمال التي تمت ترسيتها على المتعاقد.</p>
                    <p className="mb-2"><span className="font-semibold">رابعًا:</span> إذا قررت الجهة الحكومية مصادرة الضمان، فتطلب مصادرته من البنك مصدر الضمان مباشرة وباستخدام عبارة "مصادرة الضمان" بشكل صريح، وعلى البنك الاستجابة لطلب المصادرة فوراً.</p>
                </div>
                <div className="border-b border-gray-300 pb-4">
                    <h3 className="font-semibold mb-2">43	العروض البديلة</h3>
                    <p className="mb-2">{tasks?.alternativeOffers?.value || tasks?.alternativeOffers || ""}</p>
                </div>
                <div className="pb-4">
                    <h3 className="font-semibold mb-2">44	متطلبات تنسيق العروض</h3>
                    <ul className="pr-5 space-y-2">
                        <li><span>أ.</span> {tasks?.fontSize || "‌حجم الخط."}</li>
                        <li><span>ب.</span> {tasks?.fileType || "نوع وامتدادات الملفات الإلكترونية"}</li>
                    </ul>
                </div>
            </div>
        </div>
    )
}

export default SixteenthPage