import React from 'react'

const TwentyFirstPage: React.FC<any> = ({ tasks }: { tasks: any }) => {
    return (
        <div className="w-full text-black">
            <div className="py-6 mx-auto space-y-4 ">
                <div className="border-b border-gray-300 pb-4 mb-6">
                    <h3 className="font-semibold">القسم السادس: متطلبات التعاقد</h3>
                </div>

                <div className="border-b border-gray-300 pb-4 mb-6">
                    <h3 className="font-semibold mb-2">56. إخطار الترسية</h3>
                    <p>
                        تقوم الجهة الحكومية بإرسال خطاب الترسية للمتنافس / المتنافسين الفائزين عن طريق البوابة الإلكترونية أو الوسيلة البديلة، ويتضمن الخطاب نطاق العمل، والقيمة، وتاريخ بداية العقد، وأن قرار الترسية لا يرتب أي التزام قانوني أو مالي على الجهة الحكومية إلا بعد توقيع العقد من جميع الأطراف.
                    </p>
                </div>


                <div className="border-b border-gray-300 pb-4 mb-6">
                    <h3 className="font-semibold mb-3">57. الضمان النهائي</h3>
                    <p className="mb-3"><span className="font-semibold">أولاً:</span> يجب على من تتم الترسية عليه تقديم ضمان نهائي بنسبة ({tasks?.finalGuaranteePercentage || "5"} %) من قيمة العقد، وذلك خلال ({tasks?.finalGuaranteeDays || "خمسة عشر"}) يوم عمل من تاريخ إبلاغه بالترسية، ويجوز للجهة للحكومية تمديد هذه المدة لمدة مماثلة واحدة، وأما في الأعمال والمشتريات التي تنفذ خارج المملكة العربية السعودية؛ يجوز للجهة تمديد تلك المدة لمدد مماثلة بما تراه محققاً للمصلحة. </p>
                    <p className="mb-3"><span className="font-semibold">ثانياً:</span> إذا كان صاحب العرض من المنشآت الصغيرة أو المتوسطة يتوجب عليه دفع غرامة مالية إلى الجهة الحكومية تساوي قيمة الضمان الابتدائي، إذا لم يقدم الضمان النهائي في حال تمت الترسية عليه، وفي حال مرور (60) ستين يوماً من تاريخ انتهاء مهلة تقديم الضمان النهائي دون أن يقوم بدفع الغرامة المالية المقررة يعاقب بمنعه من التعامل مع الجهات الحكومية لمدة (سنة).</p>
                    <p className="mb-3"><span className="font-semibold">ثالثاً:</span> يجب على الجهة الحكومية الاحتفاظ بالضمان النهائي إلى أن يفي المتعاقد معه بالتزاماته ويستلم المشروع استلاماً نهائياً، وفقاً لأحكام العقد وشروطه.</p>
                    <p className="mb-3"><span className="font-semibold">رابعاً:</span> مع مراعاة المادة (الحادية والستون) من النظام، لا يلزم تقديم الضمان النهائي في الحالات الآتية:</p>
                    <ul className="pr-5 space-y-2 mb-3">
                        <li><span>أ.</span>  ‌إذا كانت قيمة الأعمال والمشتريات لا تتجاوز (مائة ألف) ريال.</li>
                        <li><span>ب.</span> ‌التعاقد بين الجهات الحكومية.</li>
                        <li><span>ج.</span> ‌التعاقد مع مؤسسة أو جمعية أهلية أو كيان غير هادف إلى الربح.</li>
                        <li><span>د.</span> ‌التعاقد مع الشركات التي تملك الدولة فيها نسبة لا تقل عن (51%) من رأس مالها.</li>
                        <li><span>ه.</span> ‌إذا كُلف المتعاقد بأعمال إضافية.</li>
                        <li ><span>و.</span> ‌{tasks?.outsideOfKingdomOfSaudiArabia || ""} </li>
                    </ul>
                </div>

                <div className="border-b border-gray-300 pb-4 mb-6">
                    <h3 className="font-semibold mb-2">58. توقيع العقد</h3>
                    <p>
                        مع مراعاة الفقرة (2) من المادة (الخامسة والخمسين) من النظام، لا يجوز البدء في تنفيذ الأعمال المتعاقد عليها قبل توقيع العقد، وتحدد الجهة الحكومية موعداً لتوقيع العقد بعد تقديم الضمان النهائي، وأما في الحالات التي لا يلزم فيها تقديم الضمان النهائي بموجب البند (رابعاً) من الفقرة (57) من هذه الكراسة فيكون تحديد موعد توقيع العقد بعد صدور قرار الترسية والإعلان عنه، فإن تأخر عن الموعد المحدد دون عذر مقبول، يتم إنذاره بذلك، فإذا لم يحضر لتوقيع العقد خلال (15) خمسة عشر يوماً من تاريخ إنذاره، يلغى قرار الترسية وذلك دون إخلال بحق الجهة الحكومية في الرجوع على صاحب العرض الفائز للتعويض عما لحق بها من ضرر، وتزود اللجنة المنصوص عليها في المادة (الثامنة والثمانين) من النظام بنسخة من القرار؛ للنظر في هذه المخالفة.
                    </p>
                </div>
                <div>
                    <h3 className="font-semibold mb-2">59. الغرامات</h3>
                </div>
            </div>
        </div>
    )
}

export default TwentyFirstPage